hw3/rottenpotatoes/app/controllers/movies_controller.rb

  def index
    @movies = Movie.all
---
SELECT * FROM "movies"

  def show
    @movie = Movie.find(params[:id])
---
SELECT * FROM "movies" WHERE ("movies"."id" = 1)

  def edit
    @movie = Movie.find(params[:id])
---
SELECT * FROM "movies" WHERE ("movies"."id" = 1)

  def create
    @movie = Movie.search_by_id(params[:id])

    respond_to do |format|
      if @movie.save
---
INSERT INTO "movies" ("rating", "created_at", "title", "released_on", "updated_at", "description") VALUES('G', '2010-09-17 06:08:18', 'Hi', '2010-09-17 00:00:00', '2010-09-17 06:08:18', 'Hi')